{
  "metadata": {
    "url": "https://www.studentbeans.com/us",
    "name": "Student Beans",
    "created_at": "2025-12-05T17:23:55.268858",
    "pages_scraped": 10,
    "has_web_search_supplement": true
  },
  "primary_content": {
    "source": "website_scraping",
    "reliability": "high",
    "pages": [
      {
        "title": "Free Student Discounts US | Valid 2025 Codes",
        "description": "Looking for free student discounts? We work with brands to get you exclusive student deals. Gymshark, Pandora, WHSmith etc only at Student Beans!",
        "sections": [],
        "content": "The best student discounts and more from your favorite stores The best student discounts and more from your favorite stores Your new favorite student discount website with deals you won't find anywhere else Your new favorite student discount website with deals you won't find anywhere else Cyber Week meets fashion Cyber Week meets fashion Discover deals Cyber Week meets tech Cyber Week meets tech Discover deals Cyber deals just dropped Cyber deals just dropped Discover Deals Cyber deals just dropped Think you missed out? Think again. Cyber Week’s here and the savings just got bigger. View More 6 months for $0 with Prime for young adults Prime for Young Adults For students only Online Gifts & Gadgets 30-80% Off Every. Single. Thing. Princess Polly For students only Online Fashion Up to 52% Christmas Sale + Extra 10% for Students Huion For students only Online Tech & Mobile Cyber Monday - Up to 70% off + Extra 20% Student Discount Lovehoney For students only Online Fashion 30% Student Discount adidas For students only Online Fashion 10% Student Discount American Eagle For students only Online Fashion 25% Off Gap For anyone to use Online Fashion Up to 90% off + Extra 15% Student Discount for Students Online SHEIN For students only Online Fashion Extra 25% Off Aerie For anyone to use Online Womens Fashion Shop MacBook Air starting at $899 Apple For students only Online Tech & Mobile 30-day Free Trial Walmart For anyone to use Online Food & Drink 25% Off Macy's For anyone to use Online Fashion 10% Student Discount PUMA For students only Online Fashion Cyber Week meets fashion From everyday staples to party 'fits, the best style deals are still going strong. View More 15% Student Discount Gymshark For students only Online Fashion 10% Student Discount H&M For students only Online Fashion Up to 75% Off Sale Abercrombie & Fitch For anyone to use Online Fashion 15% Student Discount Harvey Nichols For students only Online Fashion 20% Student Discount Boux Avenue For students only Online Fashion 30-80% Off Every. Single. Thing. Princess Polly For students only Online Fashion 10% Student Discount Jaded London For students only Online Fashion 15% Student Discount Converse For students only Online Fashion 10% Student Discount White Fox Boutique For students only Online Fashion Up to 75% off Everything + Extra 12% Student Discount* PrettyLittleThing For students only Online Fashion 10% Student Discount + spend $285 for a free 14K Gold Bangle Pandora For students only Online Jewellery 25% Student Discount Crocs For students only Online Fashion 10% Student Discount off everything ASOS For students only Online Fashion 25% Off Macy's For anyone to use Online Fashion 10% Student Discount Marc Jacobs For students only Online Fashion 15% Student Discount YOOX For students only Online Fashion 10% Student Discount DSW For students only Online Fashion 15% Student Discount ALDO For students only Online Fashion Buy One, Get One 50% Off Tees Finish Line For anyone to use Onli",
        "url": "https://www.studentbeans.com/us",
        "page_type": "homepage"
      },
      {
        "title": "Student Beans",
        "description": "",
        "sections": [],
        "content": "Select your country/region United Kingdom United States Australia Österreich België Canada 中国 Danmark Finland France Deutschland 香港 India Ireland Italia Mexico Nederland New Zealand Nigeria Norway Polska Portugal Romania Singapore España Sverige Switzerland",
        "url": "https://www.studentbeans.com/us/country-links",
        "page_type": "subpage"
      },
      {
        "title": "Student Beans",
        "description": "",
        "sections": [],
        "content": "About Student Beans We’re Student Beans, the #1 student loyalty network. We’ve been around since 2005, and since the beginning, our mission has been to empower students to thrive. Here to take the sting out of everyday life, we help you save money on what you need, what you want and what you love, so you can focus on you and spend big on your future. Unlocking a world of student discounts from thousands of stores online and in-store, Student Beans gives you access to more savings than any other student iD card. We’re totally committed to bringing you the most exclusive deals you won’t get anywhere else, straight from your favorite brands. Our student discounts are the real deal, meaning they’ll always work to save you money, whether you’re after a new outfit, top tech or food delivered straight to your door. Why are we doing it? Being a student is a wild time of experiences, learning and exposure that shapes us in life-changing ways. It has the power to bridge divides, reduce inequalities and increase the opportunity of everyone on the planet. To put it simply, adults who thrive as students will make the world a better place. And we can’t wait to see what they have in store. Student Beans leads the way when it comes to customer service, amazing campaigns, and results. We absolutely love working with them Princess Polly The Student Beans story Student Beans was founded in 2005 in Birmingham, UK, by James and Michael Eder, named after the British student staple, baked beans. As young university graduates themselves, the brothers saw a gap in the market for a digital student loyalty platform that would give students exclusive discounts on the brands they love. Quickly becoming a part of everyday student life, Student Beans revolutionised the concept of the student iD for the digital age. We launched our award-winning verification technology, enabling brands to ensure their student discounts are only available to verified students. Today, we partner with thousands of the world’s biggest brands across fashion , technology , food , entertainment and more, and power a global network of students in over 160 countries. Meet our leadership team Mike Eder Chief Executive Officer Mike is our co-founder, CEO and Chief Product Officer, whose dream is to climb Mount Everest one day. In prep, he climbed Africa’s tallest mountain, Kilimanjaro, in 2020. Will Briggs Chief Finance Officer Meet Will, our Chief Financial Officer, who oversees everything in finance, legal, payroll and data. Outside of work, Will’s obsessed with golf. The data and technical aspects keep him awake at night! Jenny Crawford Chief People Officer Jenny heads up our Talent and People team. When not working, she’s a busy mum to three sons and a cat named Miles who keeps her on her toes. Rich Holgate Chief of Staff Chief of Staff, Rich, ensures our CEO and senior management teams are set up for success. Outside life at Student Beans, he’s played the piano for nearly 30 years and recently became",
        "url": "https://www.studentbeans.com/us/about",
        "page_type": "subpage"
      },
      {
        "title": "What is a Student Discount & How To Get The Best With Student Beans",
        "description": "Get the best student discounts, deals & freebies with Student Beans. See how it all works & get the best savings with the Student Beans website, app, & ID card.",
        "sections": [],
        "content": "How it Works How to get a student discount Being a student is a wild time, and we know money can be tight. Here to take the sting out of everyday life, Student Beans offers unmissable student discounts from the brands you love the most. But what is a student discount ? A student discount is an exclusive saving on a product or service, offered only to students studying at university, college, school and other places of higher education. From freebies, to money and percentages off the total price, discounts vary from brand to brand. All you need to do is flash your Student Beans iD card in-store, or add your promo code to your basket or at the checkout online to unlock discounts. Online or in-store student discounts Whether you’re at home or on the go, there’s loads of ways to save at Student Beans. Shopping online? Redeem discounts on our app and website in minutes, just search the brand, copy the code and apply it to the basket. Not sure where to start or which stores do student discounts? Take a look at our top 20 best student discounts and discover what deals are trending right now, or browse our categories to find your favorite brands with savings on food , broadband , laptops , cinema , train tickets and more. Our discounts are more than just codes, and if you’re in-store, you can enjoy instant access to student discounts by using the in-store tab or filter the category pages on our app . Who can sign up for student discounts? Our discounts are available for students who are studying in full time education and given a personal institution email or credit card style student iD. This includes high school students over the age of 16, sixth form students, college students, university students and apprentices. Registering with us is fast, free and easy Register and verify your student status in just a few clicks. We’ve made it as simple and quick as possible for you to sign up with Student Beans, with most registrations taking just one minute. Once you’ve signed up, if your email domain is recognised you will be verified straight away. If you’ve added a new place of study, our support team will manually review your application and get back to you. Need help with registration or verification? No problem. Visit our help centre . Reverify your student status annually You need to tell us you’re still a student in full time education to keep your account active and enjoy another 12 months of amazing discounts. Reverifying is super easy and only takes two minutes, and don’t worry, we’ll let you know when your iD is about to expire so you don’t miss out.",
        "url": "https://www.studentbeans.com/us/how-it-works",
        "page_type": "subpage"
      },
      {
        "title": "Student Discount App | The Best Student Beans Discounts in your Hand",
        "description": "Instant access to student discounts. Wherever you are. Whenever you want. Get codes instantly with the Student Beans app for iPhone and Android.",
        "sections": [
          {
            "heading": "SAVE SO MUCH MORE WITH OUR APP",
            "content": "✅ Get instant alerts from your fave followed brands ✅ Win incredible prizes every Wednesday ✅ Discover & save on 1,000s of brands"
          },
          {
            "heading": "But don’t just take our word for how great the StudentBeans app is for doling out the discounts, read our reviews..",
            "content": "★ 4.8 Based on over 50k reviews"
          },
          {
            "heading": "Life changing",
            "content": "Living in London on a student budget is getting more difficult, but services like Student Beans are genuinely life changing! I feel that students should really make use of the wide range of products and services offered to save up a consistent amount of money. LB Luce Biscardi Second year undergrad student"
          },
          {
            "heading": "Helps student save",
            "content": "I think Student Beans is great and provides quick access to discounts that helps students save when they’re already struggling. RR Rasane Rajib Foundation year student"
          },
          {
            "heading": "Love Student Beans",
            "content": "Love, Love, LOVE Student Beans. They have helped me out on so many different occasions. Their discount codes and blogs are super encompassing. I totally see their attempts to help us thrive. NC Natasha Chapman Third year undergrad student"
          }
        ],
        "content": "★ 4.8 | 50k ratings SAVE SO MUCH MORE WITH OUR APP ✅ Get instant alerts from your fave followed brands ✅ Win incredible prizes every Wednesday ✅ Discover & save on 1,000s of brands Get instant alerts from your favorite brands Follow the brands you love and you’ll be the first to hear about new discounts and exclusive deals. Saving you time and money! Turn Wednesdays into Winsdays With the Student Beans app you’ll have the chance to win huge prizes from some of the biggest and best-known brands - every, single Wednesday. Search thousands of brands We’re talking tech, fashion, beauty, travel, and tons of tasty food. Whatever you’re looking for, you’ll find it on our app. Never be without your Student ID With the app on your phone, you’ll always have your verified Student ID in your pocket. But don’t just take our word for how great the StudentBeans app is for doling out the discounts, read our reviews.. ★ 4.8 Based on over 50k reviews Life changing Living in London on a student budget is getting more difficult, but services like Student Beans are genuinely life changing! I feel that students should really make use of the wide range of products and services offered to save up a consistent amount of money. LB Luce Biscardi Second year undergrad student Helps student save I think Student Beans is great and provides quick access to discounts that helps students save when they’re already struggling. RR Rasane Rajib Foundation year student Love Student Beans Love, Love, LOVE Student Beans. They have helped me out on so many different occasions. Their discount codes and blogs are super encompassing. I totally see their attempts to help us thrive. NC Natasha Chapman Third year undergrad student WHY ARE YOU STILL SCROLLING?",
        "url": "https://www.studentbeans.com/us/about/apps",
        "page_type": "subpage"
      },
      {
        "title": "Get the Student Beans Browser Extension",
        "description": "Want thousands of discounts without lifting a finger? It’s never been easier to save on the brands you love than with our handy Student Beans Chrome extension.",
        "sections": [
          {
            "heading": "GET THE SB CHROME EXTENSION",
            "content": "It’s never been easier to save than with our handy Student Beans Chrome extension. ✅ It’s easy, free and fast ✅ Save time and money with instant alerts for your fave brands ✅ Say goodbye to searching for codes"
          },
          {
            "heading": "Thank you Student Beans",
            "content": "“For once, my 30 minutes of scouring the internet for coupons actually paid off! THANK YOU STUDENT BEANSSSS”"
          },
          {
            "heading": "It works really well",
            "content": "“it works really well and it saved me quit a bit of money already reminding me about the discounts I can use :) thanks!”"
          },
          {
            "heading": "I never miss a discount",
            "content": "“This extension is amazing! It does all the work for me and I never miss a discount when doing some online shopping. Easiest way to save money!”"
          },
          {
            "heading": "Start saving rn",
            "content": "Add the Student Beans Chrome extension today and never miss a chance to save—wherever you shop."
          }
        ],
        "content": "GET THE SB CHROME EXTENSION It’s never been easier to save than with our handy Student Beans Chrome extension. ✅ It’s easy, free and fast ✅ Save time and money with instant alerts for your fave brands ✅ Say goodbye to searching for codes Add now for free 1 Add our FREE extension Head to the Google Chrome Store and click “Add to Chrome” — it’s completely free to use! 2 Never miss a deal again When you browse a website, you’ll see a pop-up telling you that “discounts have been found”. See? We told you it was easy. 3 Save instantly Click “reveal discounts” to see the deal available to you with Student Beans on the brand’s website. You can then add the code from the pop-up to save instantly. Unlock easy savings Want thousands of discounts without lifting a finger? Instantly save on the brands you love with our handy Student Beans Chrome extension. Add now for free Don’t just take our word for how great the Student Beans browser extension is for alerting you on the best discounts, read our reviews... ★ 4.6 Thank you Student Beans “For once, my 30 minutes of scouring the internet for coupons actually paid off! THANK YOU STUDENT BEANSSSS” AC Angela Chen It works really well “it works really well and it saved me quit a bit of money already reminding me about the discounts I can use :) thanks!” GS gosia szwed I never miss a discount “This extension is amazing! It does all the work for me and I never miss a discount when doing some online shopping. Easiest way to save money!” DP didier pruvot Start saving rn Add the Student Beans Chrome extension today and never miss a chance to save—wherever you shop. Add For Free Now",
        "url": "https://www.studentbeans.com/us/about/browser-extension",
        "page_type": "subpage"
      },
      {
        "title": "Student Discount Card | Apply for the Student Beans Discount ID Card",
        "description": "Access student-exclusive discounts at over 10,000 shops online and in-store, unlock more student discounts than any other student iD card. Fast and free sign up.",
        "sections": [
          {
            "heading": "Your Student Beans iD",
            "content": "Unlocking a world of student discounts from thousands of stores online and in-store, Student Beans iD gives you access to more savings than any other student iD card. It’s free, it’s fast, and it’ll save you money. Every. Single. Time."
          }
        ],
        "content": "Your Student Beans iD Unlocking a world of student discounts from thousands of stores online and in-store, Student Beans iD gives you access to more savings than any other student iD card. It’s free, it’s fast, and it’ll save you money. Every. Single. Time. Big brand energy Whatever your vibe, there’s a brand for you. Log in to discover exclusive deals at big brands like Apple, ASOS, 16-25 Railcard, Nike and many more. Shop in-store or online Whether you’re at home or on the go, there’s loads of ways to save at Student Beans. Redeem discounts in-store using your in-app Student Beans iD, or shop online using our app and website to grab your discount code. Save on brands’ websites You can even bag student savings on your fave brands’ websites. Lots of online stores have integrated with us to provide your Student Beans iD directly on their website, making it even easier and quicker for you to redeem your promo code. Become a brand partner We help brands connect with over 165 million students, across 52 countries. The gateway to success with Gen Z starts here…",
        "url": "https://www.studentbeans.com/id/us",
        "page_type": "subpage"
      },
      {
        "title": "Free Graduate Discounts | Valid 2025 Codes",
        "description": "Looking for free graduate discounts? We work with brands to get you exclusive graduate deals",
        "sections": [
          {
            "heading": "GRADUATE DISCOUNTS",
            "content": "Exclusive offers not available anywhere else for 5 years after you graduate Am I eligible for Grad Beans? If you have graduated within the last 5 years from a Bachelors, Masters, apprenticeship or another recognised professional course that lasted no less than 12 months and/or completed a qualification recognised by a professional body you’ll have access to Grad Beans. Can I have a Student Beans account and Grad Beans account? No, you will only be able to have either a Student Beans account or a Grad Beans account. You will be able to switch between the two. For example if you have completed your degree and sign up to Grad Beans, but decide to a masters a couple of years later, you will be able to switch back to your Student Beans account if you wish. How do I manually verify my Grad status? To be manually verified you must provide: – completion of a Bachelors, Masters, apprenticeship or another recognised professional course – proof you have completed a course that has lasted at least"
          },
          {
            "heading": "Don’t have a Student Beans account?",
            "content": "Create an account for free Upload proof that you have completed your course Get discount on all your fav brands Do you have a Student Beans account? Simply log in and you’ll gain access to Grad Beans for free"
          },
          {
            "heading": "Do you have a Student Beans account?",
            "content": "Simply log in and you’ll gain access to Grad Beans for free"
          },
          {
            "heading": "FAQs",
            "content": "What is Grad Beans? Grad Beans allows graduates to sign up and access exclusive graduate discounts. Why should I sign up Grad Beans? If you have graduated within the last 5 years, Grad Beans is a fantastic way to save money with exclusive Graduate offers from brands you know and love. It’s easy and free to sign up, so what have you got to lose? How do I sign up to Grad Beans? If you have had a Student Beans account in the past you will be able to sign into your Student Beans account and, if eligible, be able to re-verify as a graduate. If you haven’t had a Student Beans account previously you will be able to go through our manual verification process. To be verified you must provide: – completion of a Bachelors, Masters, apprenticeship or another recognised professional course – proof you have completed a course that has lasted at least 12 months – show the name of your institution where you completed your studies – shows your full name – be dated within the last 5 years I haven’t rece"
          }
        ],
        "content": "Helping Grads thrive, whatever comes next. GRADUATE DISCOUNTS Exclusive offers not available anywhere else for 5 years after you graduate Am I eligible for Grad Beans? If you have graduated within the last 5 years from a Bachelors, Masters, apprenticeship or another recognised professional course that lasted no less than 12 months and/or completed a qualification recognised by a professional body you’ll have access to Grad Beans. Can I have a Student Beans account and Grad Beans account? No, you will only be able to have either a Student Beans account or a Grad Beans account. You will be able to switch between the two. For example if you have completed your degree and sign up to Grad Beans, but decide to a masters a couple of years later, you will be able to switch back to your Student Beans account if you wish. How do I manually verify my Grad status? To be manually verified you must provide: – completion of a Bachelors, Masters, apprenticeship or another recognised professional course – proof you have completed a course that has lasted at least 12 months – show the name of your institution where you completed your studies – shows your full name – be dated within the last 5 years Filters Brands Aeroband (1) ALDO (1) Alternative Airlines (1) Anastasia Beverly Hills (1) Andie Swim (1) Anker (2) Antler (1) Aurzen (1) Avon (1) Beam (2) BEAUTY BAY (1) Beautyblender (1) Beginning Boutique (1) Bellroy (1) Bestvibe (1) Beyond Body (1) Beyond Polish (1) BlipCut (1) Bluebella (2) Bluehost (1) Blueland (1) boohoo (1) Brastop (1) Breescape (1) Brilliant Earth (1) Brother (1) BURGA (1) Calzedonia (1) Cardboard Cutout Standees (1) Catbird (1) Cernucci (1) Chamaripa (1) Charles & Keith (2) Clarins (2) Creality (1) Creality3D Official (1) CrealityFalcon (1) Cuisinart (1) Curvy Kate (1) De'Longhi (3) DERMAFLASH (1) Direct Ferries (1) DistroKid (1) Dreame Tech (1) Drop (1) e.l.f. Cosmetics (1) EatClean (1) Ekster (1) ELEGOO (1) eManualOnline (1) eufy (2) eufyMake (1) Evry Jewels (1) ExpressVPN (2) Factor (1) FARFETCH (1) FatFace (1) Fitbod (1) five CBD (1) Flaus (1) FlexClip (1) FlexiSpot (1) Flower Knows (1) Focais (1) Foxy Locks (1) Fresh (1) Gainful (1) Glassons (1) Global Amore Mall (1) Glorious Gaming (1) GOELIA (1) GOLDMoral (1) GourmetGiftBaskets.com (1) GOVEE (1) Greatness (1) Green Chef (1) GUU (2) HALARA (1) Headout (1) Helium Mobile (1) Hismile (1) HitPaw (1) HitPaw Online (1) Home Chef (1) Homestyler (1) HUSTLER Hollywood (1) iHerb (2) Inkbox (1) innisfree (1) Intimissimi (1) ISEE HAIR (2) JJ's House (1) JLab (1) JMP The Label (1) JOANN (1) Jow (1) Ka'Chava (1) Kiehl's (1) Kindling (1) Kitsch (1) Knowt (1) la Vie en Rose (1) Lahome (2) Laifen (1) Laneige (1) LastPass (1) Le Specs (1) Leeway Home (1) LEGO (2) LILYSILK (2) Linguix (1) Litter-Robot by Whisker (1) Love Spark Cove (1) Lovehoney (1) Luminar Neo (1) Maje (1) Marshall (1) Milk Makeup (1) Missacc (1) mnml (1) Modelones (1) Mondly by Pearson (2) MusicGurus (1) Nank(Naenka) (1) Nebula (2) New Sc",
        "url": "https://www.studentbeans.com/graduate-discount/us",
        "page_type": "subpage"
      },
      {
        "title": "Student Beans",
        "description": "",
        "sections": [],
        "content": "Accessibility Statement This statement applies to content published on the domain: https://www.studentbeans.com It does not apply to content or websites published on subdomains, which will have their own specific accessibility statements. This website is managed by The Beans Group Limited, trading as Pion . It is designed to be usable by as many people as possible, including people with disabilities. You will be able to: Use screen readers effectively Tab through content effectively See alt tags on all images See error messages and active states Resize text (partial support) See all colours where appropriate — to a AA contrast standard This website is designed to comply with the technical standard EN 301 549 v.3.2.1 , which closely follows level ‘AA’ of the Web Content Accessibility Guidelines (WCAG) 2.1 . Compliance Status This website is partially compliant with the above standard. See 'Non-accessible content' below for more information. The site was last tested on 2/7/2025 . Preparation of this Statement This statement was prepared on 18 June 2025 . It is based on a review of a representative sample of Pion’s web pages using a combination of automated and manual testing. Compatibility with Browsers and Assistive Technology The Student Beans marketplace website is designed to be compatible with: Mozilla Firefox, Google Chrome, Brave, Edge, Safari Screen readers Screen magnifiers Alternative input devices Speech recognition software Technical Specifications This website relies on the following technologies for accessibility: HTML CSS JavaScript Non-accessible Content We are aware of the following accessibility limitations on the Pion website: A few alt tags need translating Some focus areas can be more obvious An app page banner is pausable but not stoppable, though it can be scrolled out of view Some buttons are missing labels We plan on fixing these issues before the end of 2025, with a longer term roadmap stretching into 2026. If you encounter a problem not listed here, please let us know.",
        "url": "https://www.studentbeans.com/us/accessibility",
        "page_type": "subpage"
      },
      {
        "title": "Cyber Week meets fashion",
        "description": "",
        "sections": [],
        "content": "Cyber Week meets fashion From everyday staples to party 'fits, the best style deals are still going strong. 15% Student Discount Gymshark For students only Online 10% Student Discount H&M For students only Online Up to 75% Off Sale Abercrombie & Fitch For anyone to use Online 15% Student Discount Harvey Nichols For students only Online 20% Student Discount Boux Avenue For students only Online 30-80% Off Every. Single. Thing. Princess Polly For students only Online 10% Student Discount Jaded London For students only Online 15% Student Discount Converse For students only Online 10% Student Discount White Fox Boutique For students only Online Up to 75% off Everything + Extra 12% Student Discount* PrettyLittleThing For students only Online 10% Student Discount + spend $285 for a free 14K Gold Bangle Pandora For students only Online 25% Student Discount Crocs For students only Online 10% Student Discount off everything ASOS For students only Online 25% Off Macy's For anyone to use Online 10% Student Discount Marc Jacobs For students only Online 15% Student Discount YOOX For students only Online 10% Student Discount DSW For students only Online 15% Student Discount ALDO For students only Online Buy One, Get One 50% Off Tees Finish Line For anyone to use Online 10% Student Discount Oner Active For students only Online 10% Student Discount American Eagle For students only Online 10% Student Discount on Menswear AYBL For students only Online Extra 10% Student Discount Hollister For students only Online",
        "url": "https://www.studentbeans.com/student-discount/US/collections/black-friday-fashion-60e49cbe-d8cb-4935-8886-222ede4275de",
        "page_type": "subpage"
      }
    ]
  },
  "secondary_content": {
    "source": "web_search",
    "reliability": "medium",
    "searches": [
      {
        "index": 1,
        "result": "Student Beans provides several contact methods for assistance:\n\n- **Customer Service Email**: help@studentbeans.com\n\n- **Customer Service Phone**: +44 303 123 1113\n\n- **Business Customer Service Phone**: +44 207 864 2675\n\n- **Headquarters Address**: Piano Yard, 30a Highgate Road, London, England NW5 1NS, United Kingdom\n\nFor data protection inquiries, contact the Data Protection Officer at infosec@studentbeans.com or by post to 1 Vincent Square, London SW1P 2PN. ([accounts.studentbeans.com](https://accounts.studentbeans.com/es/info/privacy?utm_source=openai))\n\nIn the U.S., Student Beans has an office at 450 Park Ave S, 3rd Floor, New York, NY 10016. ([pissedconsumer.com](https://www.pissedconsumer.com/company/student-beans/customer-service.html?utm_source=openai))\n\nFor student support, visit the Help Centre at help.studentbeans.com/hc/en-us. ([help.studentbeans.com](https://help.studentbeans.com/hc/en-us?utm_source=openai)) "
      },
      {
        "index": 2,
        "result": "Student Beans offers a free service to students, providing access to exclusive discounts from various brands. To utilize these discounts, students must register and verify their status through the Student Beans platform. Once verified, they can access a wide range of deals across categories like fashion, tech, food, and travel. \n\nFor businesses, Student Beans provides a self-service platform to create and manage student discount offers. Pricing for this service is structured as a subscription model, with options for monthly or annual payments. Choosing the annual subscription offers a 33% discount compared to the monthly plan. Additionally, businesses can opt for a cost-per-click (CPC) model, where they pay a fee each time a student clicks on their discount offer. The CPC rates vary by currency: $0.70 USD, £0.50 GBP, €0.60 EUR, $0.80 CAD, and $0.90 AUD. ([partner.studentbeans.com](https://partner.studentbeans.com/verification/self-service/pricing/options/?utm_source=openai)) "
      },
      {
        "index": 3,
        "result": "Student Beans partners with numerous brands to offer exclusive discounts to students across various categories. Notable fashion retailers include Adidas, American Eagle, Gap, Nike, and PUMA, each providing student discounts ranging from 10% to 30%. For tech enthusiasts, Apple offers discounts on products like the MacBook Air, while Samsung provides up to 20% off on select items. Home and lifestyle brands such as GOVEE and Bose also extend student discounts through the platform. ([studentbeans.com](https://www.studentbeans.com/us?utm_source=openai))\n\nBeyond these, Student Beans collaborates with a diverse array of brands, including The Body Shop, LSKD, Los Angeles Apparel, Ticketmaster, Swappie, Lacoste, MuscleFood, Flex, Varsity Tutors, and more. These partnerships encompass sectors like health and beauty, sportswear, entertainment, and education, reflecting the platform's broad appeal to students' varied interests. ([partner.studentbeans.com](https://partner.studentbeans.com/company-n"
      }
    ]
  }
}